In [292]:
import numpy as np
import pandas as pd

**Reading and Writing Data in Text Format**

In [293]:
df = pd.read_csv('/content/sample_data/ex1.csv')
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [294]:
pd.read_table('/content/sample_data/ex1.csv', sep=',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

**Using File Example-2(ex2)**

In [295]:
df = pd.read_csv('/content/sample_data/ex2.csv')
df

   1   2   3   4  hello
0  5   6   7   8  world
1  9  10  11  12    foo

In [296]:
pd.read_csv('/content/sample_data/ex2.csv', header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [297]:
pd.read_csv('/content/sample_data/ex2.csv', names=['a', 'b', 'c', 'd', 'message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

**Using Mindex Csv File**

In [298]:
!cat /content/sample_data/mindex.csv

key1,key2,value1,value2
one,a,1,2
one,b,3,4
one,c,5,6
one,d,7,8
two,a,9,10
two,b,11,12
two,c,13,14
two,d,15,16

In [299]:
dfMinindex = pd.read_csv('/content/sample_data/mindex.csv')
dfMinindex

  key1 key2  value1  value2
0  one    a       1       2
1  one    b       3       4
2  one    c       5       6
3  one    d       7       8
4  two    a       9      10
5  two    b      11      12
6  two    c      13      14
7  two    d      15      16

In [300]:
dfMinindex = pd.read_csv('/content/sample_data/mindex.csv',index_col=['key1', 'key2'])
dfMinindex

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

**Using Text File - Ex-3**

In [301]:
list(open('/content/sample_data/ex3.txt'))

['            A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491\n']

In [302]:
result = pd.read_table('/content/sample_data/ex3.txt', sep='\s+')
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

**Using Csv - Ex4 File**

In [303]:
!cat /content/sample_data/ex4.csv

# hey!
a,b,c,d,message
# just wanted to make things more difficult for you
# who reads CSV files with computers, anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [304]:
DfEx4 = pd.read_csv('/content/sample_data/ex4.csv', skiprows=[0, 2, 3])
DfEx4

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

**Using Csv Ex5 File**

In [305]:
df5 = pd.read_csv('/content/sample_data/ex5.csv')
df5

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [306]:
pd.isnull(df5)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [307]:
result = pd.read_csv('/content/sample_data/ex5.csv', na_values=['NULL'])
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [308]:
sentinels = {'a': ['5'], 'b':['2'], 'something': ['three']}
pd.read_csv('/content/sample_data/ex5.csv', na_values=sentinels)

  something    a     b     c   d message
0       one  1.0   NaN   3.0   4     NaN
1       two  NaN   6.0   NaN   8   world
2       NaN  9.0  10.0  11.0  12     foo

**Reading Text Files in Pieces**

In [309]:
pd.options.display.max_rows = 10

In [310]:
result = pd.read_csv('/content/sample_data/ex6.csv')
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [311]:
pd.read_csv('/content/sample_data/ex6.csv', nrows=5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [312]:
chunker = pd.read_csv('/content/sample_data/ex6.csv', chunksize=1000)
chunker

In [313]:
tot = pd.Series([])
for piece in chunker:
    tot = tot.add(piece['key'].value_counts(), fill_value=0)

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  """Entry point for launching an IPython kernel.

In [314]:
tot = tot.sort_values(ascending=False)

In [315]:
tot[:10]

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
dtype: float64

**Writing Data to Text Format**

In [316]:
data = pd.read_csv('/content/sample_data/ex5.csv')
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [317]:
data.to_csv('/content/sample_data/out.csv')

In [318]:
!cat /content/sample_data/out.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [319]:
import sys

In [320]:
data.to_csv(sys.stdout, sep='|')

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [321]:
data.to_csv(sys.stdout, na_rep='NULL')

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [322]:
data.to_csv(sys.stdout, index=False, header=False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [323]:
data.to_csv(sys.stdout, index=False, columns=['a', 'b', 'c'])

a,b,c
1,2,3.0
5,6,
9,10,11.0

In [324]:
dates = pd.date_range('1/1/2000', periods=7)

In [325]:
ts = pd.Series(np.arange(7), index=dates)

In [326]:
ts.to_csv('/content/sample_data/out.csv')

In [327]:
!cat /content/sample_data/out.csv

,0
2000-01-01,0
2000-01-02,1
2000-01-03,2
2000-01-04,3
2000-01-05,4
2000-01-06,5
2000-01-07,6

**Working with Delimited Formats**

In [328]:
!cat /content/sample_data/ex7.csv

"a","b","c"
"1","2","3"
"1","2","3"

In [329]:
import csv

In [330]:
f = open('/content/sample_data/ex7.csv')
reader = csv.reader(f)

In [331]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [332]:
with open('/content/sample_data/ex7.csv') as f:
    lines = list(csv.reader(f))

In [333]:
header, values = lines[0], lines[1:]

In [334]:
data_dict = {h: v for h, v in zip(header, zip(*values))}
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

**JSON Data**

In [335]:
obj = """
{"name": "Wes",
 "places_lived": ["United States", "Spain", "Germany"],
 "pet": null,
 "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
              {"name": "Katie", "age": 38,
               "pets": ["Sixes", "Stache", "Cisco"]}]
}
"""

In [336]:
import json

In [337]:
result = json.loads(obj)
result

{'name': 'Wes',
 'pet': None,
 'places_lived': ['United States', 'Spain', 'Germany'],
 'siblings': [{'age': 30, 'name': 'Scott', 'pets': ['Zeus', 'Zuko']},
  {'age': 38, 'name': 'Katie', 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [338]:
asjson = json.dumps(result)

In [339]:
siblings = pd.DataFrame(result['siblings'], columns=['name', 'age'])
siblings

    name  age
0  Scott   30
1  Katie   38

In [340]:
!cat /content/sample_data/example.json

[{"a": 1, "b": 2, "c": 3},
 {"a": 4, "b": 5, "c": 6},
 {"a": 7, "b": 8, "c": 9}]

In [341]:
data = pd.read_json('/content/sample_data/example.json')
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [342]:
print(data.to_json())
print(data.to_json(orient='records'))

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}
[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

**XML and HTML: Web Scraping**

In [343]:
tables = pd.read_html('/content/sample_data/fdic_failed_bank_list.html')

In [344]:
len(tables)

1

In [345]:
failures = tables[0]

In [346]:
failures.head()

                      Bank Name  ...       Updated Date
0                   Allied Bank  ...  November 17, 2016
1  The Woodbury Banking Company  ...  November 17, 2016
2        First CornerStone Bank  ...  September 6, 2016
3            Trust Company Bank  ...  September 6, 2016
4    North Milwaukee State Bank  ...      June 16, 2016

[5 rows x 7 columns]

In [347]:
close_timestamps = pd.to_datetime(failures['Closing Date'])

In [348]:
close_timestamps.dt.year.value_counts()

2010    157
2009    140
2011     92
2012     51
2008     25
       ...
2004      4
2001      4
2007      3
2003      3
2000      2
Name: Closing Date, Length: 15, dtype: int64

**Binary Data Formats**

In [349]:
frame = pd.read_csv('/content/sample_data/ex1.csv')
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

**Reading Microsoft Excel Files**

In [350]:
xlsx = pd.ExcelFile('/content/sample_data/ex1.xlsx')

In [351]:
pd.read_excel(xlsx, 'Sheet1')

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [352]:
frame = pd.read_excel('/content/sample_data/ex1.xlsx', 'Sheet1')
frame

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [353]:
writer = pd.ExcelWriter('/content/sample_data/ex2.xlsx')
frame.to_excel(writer, 'Sheet1')
writer.save()

In [354]:
frame.to_excel('/content/sample_data/ex2.xlsx')

In [355]:
!rm /content/sample_data/ex2.xlsx

**Interacting with Web APIs**

In [356]:
import requests

In [357]:
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'
resp = requests.get(url)
resp

In [358]:
data = resp.json()
data[0]['title']

'tests with fixture for dtypes added'

In [359]:
issues = pd.DataFrame(data, columns=['number', 'title',
                                     'labels', 'state'])
issues

    number  ... state
0    44836  ...  open
1    44835  ...  open
2    44834  ...  open
3    44833  ...  open
4    44832  ...  open
..     ...  ...   ...
25   44796  ...  open
26   44794  ...  open
27   44793  ...  open
28   44792  ...  open
29   44791  ...  open

[30 rows x 4 columns]

**Interacting with Databases**

In [360]:
import sqlite3

In [361]:
query = """
CREATE TABLE test
(a VARCHAR(20), b VARCHAR(20),
 c REAL,        d INTEGER
);"""

In [362]:
con = sqlite3.connect('mydata.sqlite')

In [363]:
con.execute(query)

In [364]:
con.commit()

In [365]:
data = [('Atlanta', 'Georgia', 1.25, 6),
        ('Tallahassee', 'Florida', 2.6, 3),
        ('Sacramento', 'California', 1.7, 5)]

In [366]:
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"

In [367]:
con.executemany(stmt, data)
con.commit()

In [368]:
cursor = con.execute('select * from test')

In [369]:
rows = cursor.fetchall()
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [370]:
cursor.description
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [371]:
import sqlalchemy as sqla

In [372]:
db = sqla.create_engine('sqlite:///mydata.sqlite')

In [373]:
pd.read_sql('select * from test', db)

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [374]:
!rm mydata.sqlite